pemcauwilla/ENIB/CM33/lpc55s69_calc_starter_core0/source/sysdep.c
/****************************************************************
 * calc
 *  (C) 1993-2021 R. Grothmann
 *  (C) 2021-     E. Bouchare
 *
 * sysdep.c
 *
 ****************************************************************/
/* Primitive user interface for calc.
	- wait does not work, but waits for a keystroke
*/

#include <stdlib.h>
#include <stdio.h>
#include <ctype.h>
#include <fcntl.h>

#include "fsl_debug_console.h"
#include "pin_mux.h"
#include "board.h"
#include "fsl_power.h"
#include "fsl_usart.h"
#include "fsl_powerquad.h"

#include "fsl_sd.h"
#include "ff.h"
#include "diskio.h"

#include "sysdep.h"
#include "calc.h"
#include "stack.h"
#include "sysdep_pcm.h"

#include "lcd.h"

#include <string.h>

/*******************************************************************************
 * global calc struct
 ******************************************************************************/

Calc _calc;
Calc *calc=&_calc;

static int omode=CC_EDIT;

static volatile bool updateFS =false;

/*******************************************************************************
 * STANDARD UART-CONSOLE INPUT/OUTPUT ROUTINES
 ******************************************************************************/
#define RING_BUF_SIZE	32

typedef volatile struct RingBuffer {
	char data[RING_BUF_SIZE];
	int	i_w;
	int i_r;
} RingBuffer;

RingBuffer rxbuf = {
	.i_w=0,
	.i_r=0
};

RingBuffer txbuf = {
	.i_w=0,
	.i_r=0
};

volatile int user_break=0;

// called from the ISR for each received char
void FLEXCOMM0_IRQHandler()
{
	uint32_t status = USART_GetStatusFlags(USART0);
    if ((USART0->FIFOSTAT & USART_FIFOSTAT_RXERR_MASK) != 0U) {
        /* Clear rx error state. */
        USART0->FIFOSTAT |= USART_FIFOSTAT_RXERR_MASK;
        /* clear rxFIFO */
        USART0->FIFOCFG |= USART_FIFOCFG_EMPTYRX_MASK;
    } else if (((rxbuf.i_w+1) % RING_BUF_SIZE)!=rxbuf.i_r) {
		while ((status & kUSART_RxFifoNotEmptyFlag) && (((rxbuf.i_w+1) % RING_BUF_SIZE)!=rxbuf.i_r)) {
			rxbuf.data[rxbuf.i_w]=USART0->FIFORD;
			rxbuf.i_w = (rxbuf.i_w+1) % RING_BUF_SIZE;
			status=USART_GetStatusFlags(USART0);
			user_break=1;
		}
    } else {
    	USART_ReadByte(USART0);
    }
	while ((status & kUSART_TxFifoNotFullFlag) && (txbuf.i_r!=txbuf.i_w)) {
		USART0->FIFOWR=txbuf.data[txbuf.i_r];
		txbuf.i_r=(txbuf.i_r+1) % RING_BUF_SIZE;
		status=USART_GetStatusFlags(USART0);
		if (txbuf.i_r==txbuf.i_w) {
			USART_DisableInterrupts(USART0, kUSART_TxLevelInterruptEnable);
		}
	}
}

void uart_init(USART_Type *base, uint32_t baudrate)
{
    usart_config_t config;

    /* attach 12 MHz clock to FLEXCOMM0 (debug console) */
	CLOCK_AttachClk(kFRO12M_to_FLEXCOMM0);

     /*
       * config.baudRate_Bps = 115200U;
       * config.parityMode = kUSART_ParityDisabled;
       * config.stopBitCount = kUSART_OneStopBit;
       * config.loopback = false;
       * config.enableTxFifo = false;
       * config.enableRxFifo = false;
       */
	USART_GetDefaultConfig(&config);
	config.baudRate_Bps = baudrate;
	config.enableTx     = true;
	config.enableRx     = true;

	USART_Init(base, &config, CLOCK_GetFlexCommClkFreq(0U));

	/* Enable RX interrupt. */
	USART_EnableInterrupts(base, kUSART_RxLevelInterruptEnable);
    NVIC_SetPriority(FLEXCOMM0_IRQn,3);
    NVIC_EnableIRQ(FLEXCOMM0_IRQn);
}

static void update_sd_state();

/*
 * uart_putc : send a char over the serial link (polling)
 */
void uart_putc(USART_Type *base, char c) {
	while ((txbuf.i_w+1) % RING_BUF_SIZE == txbuf.i_r) ;	// buffer full, so wait.
	uint32_t interruptMask = USART_GetEnabledInterrupts(base);
	USART_DisableInterrupts(base, interruptMask);
	txbuf.data[txbuf.i_w]=c;
	txbuf.i_w = (txbuf.i_w+1) % RING_BUF_SIZE;
	// enable TxE IRQ
    USART_EnableInterrupts(base, interruptMask|kUSART_TxLevelInterruptEnable);
}

void uart_puts(USART_Type *base, const char *s) {
	for (int i=0; s[i]!=0; i++) {
		uart_putc(base, s[i]);
	}
}

/*
 * uart_getc : get a char from the serial link (blocking)
 */
char uart_getc(USART_Type *base)
{
	char c;
    uint32_t interruptMask = 0U;

restart:
	while (rxbuf.i_w==rxbuf.i_r && !updateFS) ;
	user_break=0;
    if (updateFS) {
    	updateFS=false;
    	update_sd_state();
    	goto restart;
    }
	interruptMask = USART_GetEnabledInterrupts(base);
	USART_DisableInterrupts(base, interruptMask);
	c=rxbuf.data[rxbuf.i_r];
	rxbuf.i_r = (rxbuf.i_r+1) % RING_BUF_SIZE;
	USART_EnableInterrupts(base, interruptMask);
	return c;
}

/* Allow color and prompt customisation
 *   valid 'mode' parameter values include
 *   - CC_OUTPUT: prepare for output display
 *   - CC_WARN: prepare for warning display
 *   - CC_ERROR: prepare for error display
 *   - CC_EDIT: prepare for standard input (prompt "> ")
 *   - CC_FEDIT: prepare for function body input (prompt "$ ")
 */
void sys_out_mode (int mode)
{
	omode=mode;
	switch (mode) {
	case CC_OUTPUT:
	case CC_WARN:
	case CC_ERROR:
		break;
	case CC_EDIT:
		uart_puts(USART0,"> ");
		break;
	case CC_FEDIT:
		uart_puts(USART0,"$ ");
		break;
	default:
		break;
	}
}

void sys_print (char *s)
/*****
Print a line onto the text screen, parse tabs and '\n'.
Printing should be done at the cursor position. There is no need
to clear the line at a '\n'.
The cursor should move forward with the print.
Think of the function as a simple emulator.
If you have a line buffered input with echo then do not print,
when the command line is on.
*****/
{
	char crlf[3]="\r\n";
	while (*s) {
		if (*s=='\n') {
			uart_puts(USART0,crlf);
		} else {
			uart_putc(USART0,*s);
		}
		s++;
	}
}

/***** 
	wait for a keystroke. return the scancode and the ascii code.
	scancode should be a code from scan_t. Do at least generate
	'enter'.
*****/
int sys_wait_key (scan_t *scan)
{
	char c=uart_getc(USART0);
	switch (c) {
	case '\r':
	case '\n':
		c='\n';
		*scan=enter;
		break;
	default:
		*scan=key_normal;
	}
	return c;
}

int sys_test_key (void)
/***** test_key
	see, if user pressed the keyboard.
	return the scancode, if he did.
*****/
{
	if (USART0->FIFOSTAT & USART_FIFOSTAT_RXNOTEMPTY_MASK) {
		USART_ReadByte(USART0);
		return escape;
	}
	return 0;
}

int test_code (void)
/***** test_code
	see, if user pressed the keyboard.
	return the scancode, if he did.
*****/
{	return 0;
}

/****
The following text screen commands should be emulated on a graphic
work station. This can be done by a standard emulator (e.g. VT100)
or within a window displaying the text. Additional features may be
added, such as viewing old text. But the input line should be
visible as soon as a key is pressed by the user.
****/

void sys_clear (void)
/***** Clear the text screen
******/
{
	/* A COMPLETER */
}

void text_mode ()
{
}

void move_cl_cb (void)
/* move the text cursor left */
{
	/* A COMPLETER */
}

void move_cr_cb (void)
/* move the text cursor right */
{
	/* A COMPLETER */
}

