pemcauwilla/ENIB/CM33/lpc55s69_calc_starter_core0/source/sysdep.c
/* fs_mkdir --> mkdir command
 *   create a new directory
 */
int fs_mkdir(char* dirname)
{
	if (!card_ready) return -1;

	/* A COMPLETER */

	return -1;
}

/* fs_rm --> rm command
 *   delete a file or empty directory
 */
int fs_rm(char* filename)
{
	if (!card_ready) return -1;

	/* A COMPLETER */

	return -1;
}

/************************ libc stubs *******************/
/*   file access:
 *   - to load modules
 *   - to read the help text
 */
#define MAX_FILES			5

FIL files[MAX_FILES];
int cur_file=-1;

int _open(const char *name, int flags, int mode) {
	FRESULT res;

	/* A COMPLETER */
	
	return -1;
}

int _close(int fd) {

	/* A COMPLETER */

	return -1;
}

int _read(int fd, char *ptr, int len) {

	/* A COMPLETER */

	return -1;
}

int _write(int fd, char *ptr, int len) {

	/* A COMPLETER */

	return -1;
}


/*******************************************************************************
 * MULTICORE HANDLING
 ******************************************************************************/
#ifdef MULTICORE_APP
#ifdef CORE1_IMAGE_COPY_TO_RAM
uint32_t get_core1_image_size(void)
{
    uint32_t image_size;
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
    image_size = (uint32_t)&Image$$CORE1_REGION$$Length;
#elif defined(__ICCARM__)
#pragma section = "__core1_image"
    image_size = (uint32_t)__section_end("__core1_image") - (uint32_t)&core1_image_start;
#elif defined(__GNUC__)
    image_size = (uint32_t)core1_image_size;
#endif
    return image_size;
}
#endif



/* mailbox communication between cores */
#define EVT_MASK						(0xFF<<24)

#define EVT_NONE						0
#define EVT_CORE_UP						(1U<<24)
#define EVT_RETVAL						(2U<<24)
static volatile bool core1_up = false;
static volatile bool core1_handshake = false;

/* --------------- MEMORY POOL -----------------*/
volatile uint32_t msgs_sent = 0;
volatile uint32_t msgs_processed = 0;
/* ---------------------------------------------*/

void mb_init(void)
{
    CLOCK_EnableClock(kCLOCK_Mailbox);
    RESET_PeripheralReset(kMAILBOX_RST_SHIFT_RSTn);
    NVIC_SetPriority(MAILBOX_IRQn, 5);
    NVIC_EnableIRQ(MAILBOX_IRQn);
}

/* pop events from CPU1 */
uint32_t mb_pop_evt(void)
{
	uint32_t evt=MAILBOX->MBOXIRQ[1].IRQ;
	MAILBOX->MBOXIRQ[1].IRQCLR=evt;
	return evt;
}

/* send event to CPU1, wait if there is already a pending event, unless force is set */
bool mb_push_evt(uint32_t evt, bool force)
{
	if (MAILBOX->MBOXIRQ[0].IRQ && !force) {
		return false;
	}
	MAILBOX->MBOXIRQ[0].IRQSET=evt;
	return true;
}

/* Mailbox IRQ handler */
void MAILBOX_IRQHandler(void)
{
	uint32_t data = mb_pop_evt();

	if ((data & EVT_MASK)==EVT_CORE_UP) {
		core1_up = true;
	} else if ((data & EVT_MASK)==EVT_RETVAL) {
		msgs_processed++;
	}
}

/* start core1 from bootaddr address */
void core1_startup(void *bootaddr)
{
	mb_init();

    // Start the CORE_1 CPU
    SYSCON->CPUCFG |= SYSCON_CPUCFG_CPU1ENABLE_MASK;

	/* Boot source for Core 1 from RAM */
	SYSCON->CPBOOT = (uint32_t)(bootaddr);

	uint32_t temp = SYSCON->CPUCTRL | 0xc0c48000U;
	SYSCON->CPUCTRL = temp | SYSCON_CPUCTRL_CPU1RSTEN_MASK | SYSCON_CPUCTRL_CPU1CLKEN_MASK;
	SYSCON->CPUCTRL = (temp | SYSCON_CPUCTRL_CPU1CLKEN_MASK) & (~SYSCON_CPUCTRL_CPU1RSTEN_MASK);

	while(!core1_up);	/* wait for core 1 to start */
}

bool handshake(void)
{
	while (!core1_handshake) {}
	core1_handshake=false;
	return true;
}

/* LCD remote interface */
#define EVT DRAWPOINT					(3U<<24)
#define EVT_DRAWLINE					(4U<<24)
#define EVT_DRAWRECT					(5U<<24)
#define EVT_DRAWRNDRECT					(6U<<24)
#define EVT_DRAWCIRCLE					(7U<<24)
#define EVT_DRAWELLISPSE				(8U<<24)
#define EVT_DRAWLINES					(9U<<24)
#define EVT_DRAWSEGMENTS				(10U<<24)
#define EVT_FILLRECT					(11U<<24)
#define EVT_CLIP						(12U<<24)
#define EVT_UNCLIP						(13U<<24)
#define EVT_DRAWPATH					(14U<<24)

#define EVT_FORECOLOR					(15U<<24)
#define EVT_BACKCOLOR					(16U<<24)
#define EVT_SETFONT						(17U<<24)

#define EVT_SETALIGN					(18U<<24)

#define EVT_DRAWSTRING					(19U<<24)
#define EVT_SETDIR						(20U<<24)

#define EVT_GETBUFFER					(30U<<24)

#endif

/*******************************************************************************
 * SHARED BUFFER
 ******************************************************************************/
#define MAXPOINTS	2048

//__attribute__ ((section(".shmem")))
//SPoint shdata[MAXPOINTS];				/* shared data buffer */
extern SPoint __start_noinit_shmem[];
SPoint *shdata=__start_noinit_shmem;


/* ------------------- MEMORY POOL -------------------*/
#define SHMEM_MAX_WORDS 4096

SPoint *shared_pool = __start_noinit_shmem;
uint32_t current_offset = 0;

SPoint* alloc_shmem_buffer(int n, uint32_t *offset) {
    if (current_offset + n > SHMEM_MAX_WORDS) {
        while (msgs_sent > msgs_processed) { // Sleep while there's not enough space to be liberated
            __WFI();
        }

        current_offset = 0; // Reset pool
    }

    *offset = current_offset;
    SPoint* allocated_ptr = &shared_pool[current_offset];
    current_offset += n;

    return allocated_ptr;
}

 /*---------------------------------------------------*/

/*******************************************************************************
 * GRAPHICS HANDLING ROUTINES
 ******************************************************************************/
typedef struct _Graph {
	int 			pxmin, pymin, pxmax, pymax, pxorg, pyorg;	// graph window in pixel coordinates
	real 			xorg, xmin, xmax, xfactor, xtick;	// x axis origin, limits and scaling
	real			yorg, ymin, ymax, yfactor, ytick;	// y axis origin, limits and scaling
	int				xscaleexp,yscaleexp;				// x and y axis factor exponent
	unsigned int	flags;								// graph style
	int				color;								// default color for next plot
	int				ltype;								// default line type for next plot
	int				lwidth;								// default line width
	int				mtype;								// default marker type for next plot
	int				msize;								// marker size
} Graph;

typedef struct GraphWindow {
	Graph			graph[9];
	int				pch, pcw;		// char pixel size
	int				n;				// number of graph used
	int				rows,cols;		// subplot layout: nb of rows, nb of columns
	int				cur;			// current graph used
} GraphWindow;

GraphWindow gw;

static Color gcolors[MAX_COLORS] = {
	BLACK,
	BLUE,
	BRED,
	GRED,
	GBLUE,
	RED,
	MAGENTA,
	GREEN,
	CYAN,
	YELLOW,
	BROWN,
	RGB(0x00,0xAE,0x00),
	RGB(0xFF,0x99,0x66),
	RGB(0x00,0x99,0xFF),
	RGB(0x99,0x66,0xCC)
};
static Color gridcolor = RGB(0xB3,0xB3,0xB3);

const Font *gsfont=&fixed8;

#ifdef LCD_CORE1
/* Display management functions */
void lcd_set_display_orientation(Orientation orientation)
{

