pemcauwilla/ENIB/CM33/lpc55s69_calc_starter_core0/source/sysdep.c
}

uint16_t lcd_get_display_width(void)
{
	return 0;
}

uint16_t lcd_get_display_height(void)
{
	return 0;
}

/* touchscreen API functions */
void    lcd_ts_id(uint8_t *ver, uint16_t *id)
{

}

uint8_t lcd_ts_get_data(uint16_t *x, uint16_t *y, uint8_t *z)
{
	return 0;
}

int lcd_ts_touched(void)
{
	return 0;
}

/* Drawing context management functions */
void lcd_get_default_DC(DC *dc)
{

}

const Font* lcd_set_font(DC *dc, const Font *font)
{
    uint32_t offset;
    SPoint *buf = alloc_shmem_buffer(1, &offset);

    buf[0].x = (short) font->width;
    buf[0].y = (short) font->height;

    // Offset (bits 11 to 23) - Font's first byte (bits 0 to 7)
    uint32_t msg = EVT_SETFONT | ((offset & 0x1FFF) << 11) | ((*font->data) & 0xFF);

    while (!mb_push_evt(msg, false)) {
    	__WFI();
    }
    msgs_sent++;

    return font;
}

Color lcd_set_forecolor(Color color)
{
    // 16 lower bits -> color
    uint32_t msg = EVT_FORECOLOR | (uint16_t)color;

    while (!mb_push_evt(msg, false)) {
        __WFI();
    }
    msgs_sent++;

    return color;
}
Color lcd_set_background(DC *dc, Color color)
{

	return color;
}

uint32_t lcd_set_alignment(DC *dc, uint32_t alignment)
{
    uint32_t offset;
    SPoint *buf = alloc_shmem_buffer(1, &offset);

    buf[0].x = (short)(alignment & 0xFFFF);
    buf[0].y = (short)((alignment >> 16) & 0xFFFF);

    uint32_t msg = EVT_SETALIGN | ((offset & 0x1FFF) << 11);
    while (!mb_push_evt(msg, false)) {
    	__WFI();
    }
    msgs_sent++;

    return alignment;
}

uint32_t lcd_set_direction(DC *dc, uint32_t direction)
{
    uint32_t offset;
    SPoint *buf = alloc_shmem_buffer(1, &offset);

    buf[0].x = direction & 0xFFFF;
    buf[0].y = (direction >> 16) & 0xFFFF;

    uint32_t msg = EVT_SETDIR | ((offset & 0x1FFF) << 11);
    while (!mb_push_evt(msg, false)) {
    	__WFI();
    }
    msgs_sent++;

    return direction;
}

/* graphic drawing functions */
void lcd_clear_screen(uint16_t color)
{

}

void lcd_draw_point(uint16_t x, uint16_t y, Color c)
{

}

void lcd_draw_line(int16_t x1, int16_t y1, int16_t x2, int16_t y2, Color c)
{

}

void lcd_draw_rect(uint16_t x, uint16_t y, uint16_t w, uint16_t h, Color c)
{
    uint32_t offset;
    SPoint *buf = alloc_shmem_buffer(3, &offset);

    buf[0].x = (short)x; buf[0].y = (short)y;
    buf[1].x = (short)w; buf[1].y = (short)h;
    buf[2].x = (short)c;

    uint32_t msg = EVT_DRAWRECT | ((offset & 0x1FFF) << 11);
    while (!mb_push_evt(msg, false)) {
    	__WFI();
    }
    msgs_sent++;
}

void lcd_draw_round_rect(int16_t x, int16_t y, int16_t w, int16_t h, int16_t r, Color c)
{

}

void lcd_draw_circle(int16_t x0, int16_t y0, int16_t r, Color c)
{

}

void lcd_draw_ellipse(Rect r, Color c, int lwidth)
{

}

void lcd_draw_segments(SPoint *p, int n, Color c)
{
	// Calculate offset to send to core 1
	uint32_t offset = p - shared_pool;

    p[2 * n].x = (short) c;

    uint32_t msg = (EVT_DRAWSEGMENTS) | ((offset & 0x1FFF) << 11) | (n & 0x7FF);

    while (!mb_push_evt(msg, false)) {
        __WFI();
    }
    msgs_sent++;
}

void lcd_draw_lines(SPoint *p, int n)
{
    if (n < MAXPOINTS) {
        uint32_t offset = p - shared_pool;

        uint32_t msg = (EVT_DRAWLINES) | ((offset & 0x1FFF) << 11) | (n & 0x7FF);

        while (!mb_push_evt(msg, false)) {
            __WFI();
        }
        msgs_sent++;
    }
}

void lcd_draw_path2d(Graph *g, SPoint *p, int n)
{
    if (n < MAXPOINTS) {
        uint32_t offset = p - shared_pool;

        p[n].x = (short) g->ltype;
        p[n].y = (short) g->mtype;

        p[n+1].x = (short) g->msize;
        p[n+1].y = (short) g->pyorg;

        p[n+2].x = (short) g->pxmin;
        p[n+2].y = (short) g->pxmax;

        p[n+3].x = (short) g->pymin;
        p[n+3].y = (short) g->pymax;

        p[n+4].x = (short) g->color;

        uint32_t msg = EVT_DRAWPATH | ((offset & 0x1FFF) << 11) | (n & 0x7FF);

        while (!mb_push_evt(msg, false)) {
            __WFI();
        }
        msgs_sent++;
    }
}

void lcd_fill_rect(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t color)
{
    uint32_t offset;
    SPoint *buf = alloc_shmem_buffer(3, &offset);

    buf[0].x = (short)x; buf[0].y = (short)y;
    buf[1].x = (short)w; buf[1].y = (short)h;
    buf[2].x = (short)color;

    uint32_t msg = EVT_FILLRECT | ((offset & 0x1FFF) << 11);

    while (!mb_push_evt(msg, false)) {
    	__WFI();
    }
    msgs_sent++;
}

/* draw lines with clipping */
void lcd_clip(int x1, int y1, int x2, int y2)
{
    uint32_t offset;
    SPoint *buf = alloc_shmem_buffer(2, &offset);

    buf[0].x = (short)x1; buf[0].y = (short)y1;
    buf[1].x = (short)x2; buf[1].y = (short)y2;

    uint32_t msg = EVT_CLIP | ((offset & 0x1FFF) << 11);
    while (!mb_push_evt(msg, false)) {
    	__WFI();
    }
    msgs_sent++;
}

void lcd_unclip(void)
{
    while (!mb_push_evt(EVT_UNCLIP, false)) {
    	__WFI();
    }
    msgs_sent++;
}

void lcd_line(int x1, int y1, int x2, int y2, Color c)
{

}

/* String drawing functions */
uint16_t lcd_draw_char(DC *dc, int16_t x, int16_t y, char c)
{
	return 0;
}

void lcd_draw_string(DC *dc, int16_t x, int16_t y, const char *s)
{
    uint32_t offset;

    // Caculate how many bytes are needed (max 100)
    int len = strlen(s);
    if (len > 100) len = 100;

    // 1 char = 1 byte. 1 SPoint = 4 bytes.
    // +1 to store x and y positions
    int n_blocos = 1 + ((len + 3) / 4); // +3 just to round up and not loose data

    SPoint *buf = alloc_shmem_buffer(n_blocos, &offset);

    buf[0].x = x;
    buf[0].y = y;

    char *destination = (char *)&buf[1];
    strncpy(destination, s, len);
    destination[len] = '\0';

    // Send offset (11 to 23) and length (0 to 10)
    uint32_t msg = EVT_DRAWSTRING | ((offset & 0x1FFF) << 11) | (len & 0x7FF);

    while (!mb_push_evt(msg, false)) { __WFI(); }
    msgs_sent++;
}

void lcd_get_string_size(DC *dc, const char *s, uint16_t *width, uint16_t *height)
{

}

void lcd_flush(void)
{

}
#endif

#define TICKSIZE		5
#define SUBTICKSIZE		3

void g_xgrid(Graph *g, header *xticks, real factor, unsigned int color)
{
    real *ticks=matrixof(xticks);
    int n=dimsof(xticks)->c;
    DC dc;

    lcd_get_default_DC(&dc);
    lcd_set_alignment(&dc,ALIGN_S);

    uint32_t offset;
    SPoint *buf;

