pemcauwilla/ENIB/CM33/lpc55s69_calc_starter_core0/source/sysdep.c
    if (!(g->flags & G_XLOG)) {
        g->xfactor = (real)(g->pxmax - g->pxmin) / (g->xmax - g->xmin);

        // Draw grid
        if (g->flags & G_XGRID) {
            // Store new buffer ONLY for grid
        	buf = alloc_shmem_buffer(2 * n + 1, &offset);
            for (int i=0 ; i<n ; i++) {
                buf[2*i].x = (short)(g->pxmin + (ticks[i] - g->xmin) * g->xfactor);
                buf[2*i].y = g->pymin;
                buf[2*i+1].x = buf[2*i].x;
                buf[2*i+1].y = g->pymax;
            }
            lcd_draw_segments(buf, n, gridcolor);
        }

        // Draw lower ticks - another separate buffer ONLY FOR LOWER TICKS
        buf = alloc_shmem_buffer(2 * n + 1, &offset);
        for (int i=0 ; i<n ; i++) {
            buf[2*i].x = (short)(g->pxmin + (ticks[i] - g->xmin) * g->xfactor);
            buf[2*i].y = g->pymin;
            buf[2*i+1].x = buf[2*i].x;
            buf[2*i+1].y = g->pymin + TICKSIZE;
        }
        lcd_draw_segments(buf, n, BLACK);

        // Upper ticks and texts - same logic, NEW BUFFER for upper ticks and texts
        buf = alloc_shmem_buffer(2 * n + 1, &offset);
        for (int i=0 ; i<n ; i++) {
            short px = (short)(g->pxmin + (ticks[i] - g->xmin) * g->xfactor);
            buf[2*i].x = px;
            buf[2*i].y = g->pymax - TICKSIZE;
            buf[2*i+1].x = px;
            buf[2*i+1].y = g->pymax;

            char s[32];
            snprintf(s,32,"%g",fabs(ticks[i]/factor) < 1e-6 ? 0.0 : ticks[i]/factor);
            lcd_draw_string(&dc, px, g->pymax + fixed12.height/2, s);
        }
        lcd_draw_segments(buf, n, BLACK);

        if (factor!=1.0) {
            char s[32];
            snprintf(s,32,"x%g", factor);
            lcd_set_alignment(&dc,ALIGN_SW);
            lcd_draw_string(&dc,g->pxmax+fixed12.width,g->pymax+2*fixed12.height,s);
        }
    } else {
        g->xfactor = (real)(g->pxmax - g->pxmin) / log10(g->xmax / g->xmin);

        // Grid (LOG)
        if (g->flags & G_XGRID) {
            buf = alloc_shmem_buffer(2 * n + 1, &offset);
            for (int i=0 ; i<n ; i++) {
                buf[2*i].x = (short)(g->pxmin + g->xfactor*log10(ticks[i]/g->xmin));
                buf[2*i].y = g->pymin;
                buf[2*i+1].x = buf[2*i].x;
                buf[2*i+1].y = g->pymax;
            }
            lcd_draw_segments(buf, n, gridcolor);
        }

        // Lower ticks (LOG)
        buf = alloc_shmem_buffer(2 * n + 1, &offset);
        for (int i=0 ; i<n ; i++) {
            short px = (short)(g->pxmin + g->xfactor*log10(ticks[i]/g->xmin));
            real d = ticks[i]/pow(10.0,floor(log10(ticks[i])));

            buf[2*i].x = px;
            buf[2*i].y = g->pymin;
            buf[2*i+1].x = px;
            buf[2*i+1].y = g->pymin + (d!=1.0 ? SUBTICKSIZE : TICKSIZE);
        }
        lcd_draw_segments(buf, n, BLACK);

        // Upper ticks and texts (LOG)
        buf = alloc_shmem_buffer(2 * n + 1, &offset);
        for (int i=0 ; i<n ; i++) {
            short px = (short)(g->pxmin + g->xfactor*log10(ticks[i]/g->xmin));
            real e = floor(log10(ticks[i]));
            real d = ticks[i]/pow(10.0,e);

            buf[2*i+1].x = px;
            buf[2*i+1].y = g->pymax;
            buf[2*i].x = px;
            buf[2*i].y = g->pymax - (d!=1.0 ? SUBTICKSIZE : TICKSIZE);

            if (d==1.0) {
                char s[32];
                snprintf(s,32,"%g", e);
                lcd_set_font(&dc,&fixed12);
                lcd_set_alignment(&dc,ALIGN_S);
                lcd_draw_string(&dc,px,g->pymax+3*fixed12.height/4,"10");
                lcd_set_font(&dc,&fixed8);
                lcd_set_alignment(&dc,ALIGN_E);
                lcd_draw_string(&dc,px+fixed12.width,g->pymax+3*fixed12.height/4,s);
            }
        }
        lcd_draw_segments(buf, n, BLACK);
    }
}

void g_ygrid(Graph *g, header *yticks, real factor, unsigned int color)
{
    real *ticks=matrixof(yticks);
    int n=dimsof(yticks)->c;
    DC dc;

    lcd_get_default_DC(&dc);
    lcd_set_alignment(&dc,ALIGN_W);

    uint32_t offset;
    SPoint *buf;

    if (!(g->flags & G_YLOG)) {
        g->yfactor = (real)(g->pymax - g->pymin) / (g->ymax - g->ymin);

        // GRID
        if (g->flags & G_YGRID) {
            buf = alloc_shmem_buffer(2 * n + 1, &offset);
            for (int i=0 ; i<n ; i++) {
                buf[2*i].x = g->pxmin;
                buf[2*i].y = g->pymax - g->yfactor*(ticks[i]-g->ymin);
                buf[2*i+1].x = g->pxmax;
                buf[2*i+1].y = buf[2*i].y;
            }
            lcd_draw_segments(buf, n, gridcolor);
        }

        // LEFT TICKS AND TEXTS
        buf = alloc_shmem_buffer(2 * n + 1, &offset);
        for (int i=0 ; i<n ; i++) {
            short py = g->pymax - g->yfactor*(ticks[i]-g->ymin);
            buf[2*i].x = g->pxmin;
            buf[2*i].y = py;
            buf[2*i+1].x = g->pxmin + TICKSIZE;
            buf[2*i+1].y = py;

            char s[32];
            snprintf(s,32,"%g",fabs(ticks[i]/factor) < 1e-6 ? 0.0 : ticks[i]/factor);
            lcd_draw_string(&dc, g->pxmin-fixed12.width/2, py, s);
        }
        lcd_draw_segments(buf, n, BLACK);

        // RIGHT TICKS
        buf = alloc_shmem_buffer(2 * n + 1, &offset);
        for (int i=0 ; i<n ; i++) {
            short py = g->pymax - g->yfactor*(ticks[i]-g->ymin);
            buf[2*i+1].x = g->pxmax;
            buf[2*i+1].y = py;
            buf[2*i].x = g->pxmax - TICKSIZE;
            buf[2*i].y = py;
        }
        lcd_draw_segments(buf, n, BLACK);

        if (factor!=1.0) {
            char s[32];
            snprintf(s,32,"x%g", factor);
            lcd_set_alignment(&dc,ALIGN_SE);
            lcd_draw_string(&dc,g->pxmin-5*fixed12.width,g->pymin-fixed12.height,s);
        }

    } else {
        g->yfactor = (real)(g->pymax - g->pymin) / log10(g->ymax / g->ymin);

        // GRID (LOG)
        if (g->flags & G_YGRID) {
            buf = alloc_shmem_buffer(2 * n + 1, &offset);
            for (int i=0 ; i<n ; i++) {
                buf[2*i].x = g->pxmin;
                buf[2*i].y = g->pymax - g->yfactor*log10(ticks[i]/g->ymin);
                buf[2*i+1].x = g->pxmax;
                buf[2*i+1].y = buf[2*i].y;
            }
            lcd_draw_segments(buf, n, gridcolor);
        }

        // LEFT TICKS AND TEXTS (LOG)
        buf = alloc_shmem_buffer(2 * n + 1, &offset);
        for (int i=0 ; i<n ; i++) {
            short py = g->pymax - g->yfactor*log10(ticks[i]/g->ymin);
            real e = floor(log10(ticks[i]));
            real d = ticks[i]/pow(10.0,e);

            buf[2*i].x = g->pxmin;
            buf[2*i].y = py;
            buf[2*i+1].x = g->pxmin + (d!=1.0 ? SUBTICKSIZE : TICKSIZE);
            buf[2*i+1].y = py;

