pemcauwilla/ENIB/CM33/lpc55s69_calc_starter_core0/source/sysdep.c
/* getplotlimits callback:
 * get the limits of the plot (xmin,xmax,ymin,ymax), and flags.
 */
void ggetplot(real *xmin, real *xmax, real *ymin, real *ymax, unsigned long *flags)
{
	if (gw.n) {
		Graph *g=gw.graph+gw.cur;
		*xmin=g->xmin; *xmax=g->xmax; *ymin=g->ymin; *ymax=g->ymax;
		*flags=g->flags;
	}
}

/* plot callback
 * plot the y=f(x) function
 */
void gplot(Calc *cc, header *hdx, header *hdy)
{
	if (gw.n) {
		Graph *g=gw.graph+gw.cur;
		g->ltype  = (g->flags & G_LTYPE_MSK)>>16;
		g->lwidth = (g->flags & G_LWIDTH_MSK)>>28;
		g->msize     = 6;
		int r=g_draw_plot(g,hdx,hdy);
		// to allow color rotation for each plot
		if (g->flags & G_AUTOCOLOR) {
			g->color=(g->color+r) % MAX_COLORS;
		}
		if (((g->flags & G_MTYPE_MSK)>>20)!=M_NONE) {
			g->mtype=(g->mtype+r) % (M_NONE-1);
		}
	}
}

/* gxgrid calback
 *   setup a manual grid for X axis
 */
void gsetxgrid(header *ticks, real factor, unsigned int color)
{
	if (gw.n) {
		Graph *g=gw.graph+gw.cur;
		g_xgrid(g,ticks,factor,color);
	}
}

/* gygrid calback
 *   setup a manual grid for Y axis
 */
void gsetygrid(header *ticks, real factor, unsigned int color)
{
	if (gw.n) {
		Graph *g=gw.graph+gw.cur;
		g_ygrid(g,ticks,factor,color);
	}
}

/* gtext callback
 *   draw the "text" string at position [x,y] with the defined attributes
 */
void gtext (real x, real y, char *text, unsigned int align, int angle, unsigned int color)
{
	DC dc;
	short px, py;
	
	lcd_get_default_DC(&dc);
	lcd_set_alignment(&dc,align<<4);
	
	if (gw.n) {
		Graph *g=gw.graph+gw.cur;
//		if (!(g->flags & G_AXISUNSET)) {
			if (!(g->flags & G_XLOG)) {
				g->xfactor = (real)(g->pxmax - g->pxmin) / (g->xmax - g->xmin);
				px = (short)(g->pxmin + (x - g->xmin) * g->xfactor);
			} else {
				g->xfactor = (real)(g->pxmax - g->pxmin) / log10(g->xmax / g->xmin);
				px = (short)(g->pxmin + log10(x / g->xmin) * g->xfactor);
			}
			if (!(g->flags & G_YLOG)) {
				g->yfactor = (real)(g->pymax - g->pymin) / (g->ymax - g->ymin);
				py = (short)(g->pymin + (g->ymax - y) * g->yfactor);
			} else {
				g->yfactor = (real)(g->pymax - g->pymin) / log10(g->ymax / g->ymin);
				py = (short)(g->pymax - log10(y /g->ymin) * g->yfactor);
			}
			
			lcd_draw_string(&dc,px,py,text);
//		}
	}
}

/* glabel callback
 *   draw the "text" string as a standard label according to second parameter
 */
void glabel(char *text, unsigned int type)
{
	DC dc;
	
	lcd_get_default_DC(&dc);
	lcd_set_alignment(&dc,ALIGN_S);
	
	if (type & G_TITLE) {
		lcd_draw_string(&dc,LCD_WIDTH/2,2,text);
	}
	if (gw.n) {
		Graph *g=gw.graph+gw.cur;
		if (type & G_XLABEL) {
			lcd_draw_string(&dc,(g->pxmin+g->pxmax)/2,g->pymax+2*gw.pch,text);
		}
		if (type & G_YLABEL) {
			lcd_set_direction(&dc,DIR_VERTICAL_INV);
			lcd_draw_string(&dc,g->pxmin-6*gw.pcw,(g->pymin+g->pymax)/2,text);
			lcd_set_direction(&dc,DIR_HORIZONTAL);
		}
	}

}

void gclear (void)
/***** clear the graphics screen
*****/
{

}

void mouse (int* x, int* y)
/****** mouse
	wait, until the user marked a screen point with the mouse.
	Return screen coordinates.
******/
{	*x=0; *y=0;
}

void getpixel (real *x, real *y)
/***** Compute the size of pixel in screen coordinates.
******/
{	*x=1;
	*y=1;
}

void gflush (void)
/***** Flush out remaining graphic commands (for multitasking).
This serves to synchronize the graphics on multitasking systems.
******/
{
}

/*******************************************************************************
 * MAIN
 ******************************************************************************/
int main ()
/******
Initialize memory and call main_loop
******/
{
	/* set BOD VBAT level to 1.65V */
	POWER_SetBodVbatLevel(kPOWER_BodVbatLevel1650mv, kPOWER_BodHystLevel50mv, false);
    BOARD_InitPins();
    BOARD_InitBootClocks();

 	/* Allocate the stack: initialize stack limit pointers */
	calc->ramstart=(char*)0x20018000;
	calc->ramend=(char*)0x20030000;

    /* UART initialization */
    uart_init(USART0,115200U);

	/* get width of the terminal */
	calc->termwidth = TERMWIDTH;

	/* clear terminal screen */
	uart_puts(USART0,"\x1b[2J\x1b[H");

	/* Enable PowerQuad Capabilities */
	PQ_Init(POWERQUAD);
	pq_config_t pq_cfg;
	PQ_GetDefaultConfig(&pq_cfg);
	PQ_SetConfig(POWERQUAD, &pq_cfg);

	/* setup sd card */
//	sd_init(/* ... */);
	
	/* set up default pathes and directory */
    OSA_TimeDelay(500);
    if (updateFS) {
    	update_sd_state();
    	updateFS=false;
    }

    /* LCD initialization */
	//lcd_init();
	//lcd_switch_to(LCD_DPY);
	ginit(&gw);

	// Codec init
	pcm_init();
	
	// Set systick reload value to generate 1ms interrupt
//    SysTick_Config(SystemCoreClock A COMPLETER);

#ifdef MULTICORE_APP
    core1_startup((void*)0x20030000);
#endif

	main_loop(calc,0,NULL);
	return EXIT_SUCCESS;
}
